Revit 2027 API
DuctSettings.NetworkBasedCalculations Property
 Indicates whether to enable network based calculations for duct networks.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool NetworkBasedCalculations { get; set; }
Public Property NetworkBasedCalculations As Boolean
	Get
	Set
public:
property bool NetworkBasedCalculations {
	bool get ();
	void set (bool value);
}
member NetworkBasedCalculations : bool with get, set
Property Value
Boolean
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace